doc/work/install_new_snailware.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Install notes for SN@ilWare software</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="description" content="Quick notes on how to install new SN@ilWare software on different machines"
 />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
<a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Install notes for SN@ilWare software</h1><hr/>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Install @ CC</a>
<ul>
<li><a href="#sec-1-1">1.1. Preamble</a>
<ul>
<li><a href="#sec-1-1-1">Configuration of <code>cmake</code></a></li>
<li><a href="#sec-1-1-2">Configuration of installation directory</a></li>
<li><a href="#sec-1-1-3">Machine configuration</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Cadfael</a>
<ul>
<li><a href="#sec-1-2-1">Checking out</a></li>
<li><a href="#sec-1-2-2">Configuration</a></li>
<li><a href="#sec-1-2-3">Ports status <code>[8/8]</code></a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Bayeux</a>
<ul>
<li><a href="#sec-1-3-1">Checking out</a></li>
<li><a href="#sec-1-3-2">Configuration</a></li>
<li><a href="#sec-1-3-3">Test programs <code>[10/10]</code></a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Falaise</a>
<ul>
<li><a href="#sec-1-4-1">Checking out</a></li>
<li><a href="#sec-1-4-2">Configuration</a></li>
<li><a href="#sec-1-4-3">Basic tests</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Install @ CC</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Preamble</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Configuration of <code>cmake</code></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
First you should use a more decent version of <code>cmake</code> by doing
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> $<span class="org-variable-name">THRONG_DIR</span>/sw/config/SL6.4/nemo_basic_sw_setup-1.0.bash
do_nemo_basics_sw_setup_1
</pre>
</div>
<p>
You will get version 2.8.10.2 of <code>cmake</code>.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Configuration of installation directory</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">export</span> <span class="org-variable-name">SW_WORK_DIR</span>=/sps/nemo/scratch/garrido/tmp
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Machine configuration</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">

<pre class="src src-sh">uname -a
Linux ccage031 2.6.32-358.14.1.el6.x86_64 <span class="org-comment-delimiter">#</span><span class="org-comment">1 SMP Tue Jul 16 14:24:33 CDT 2013 x86_64 x86_64 x86_64 GNU/Linux</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">gcc --version | head -1
<span class="org-function-name">gcc</span> (GCC) 4.4.7 20120313 (Red Hat 4.4.7-3)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Cadfael</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Checking out</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-sh">svn co https://nemo.lpc-caen.in2p3.fr/svn/Cadfael/trunk <span class="org-sh-escaped-newline">\</span>
    ${<span class="org-variable-name">SW_WORK_DIR</span>}/Cadfael/trunk
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Configuration</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
To setup <code>Cadfael</code>, first create the following directory
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir -p ${<span class="org-variable-name">SW_WORK_DIR</span>}/Cadfael/build &amp;&amp; <span class="org-builtin">cd</span> ${<span class="org-variable-name">SW_WORK_DIR</span>}/Cadfael/build
</pre>
</div>
<p>
Then simply do
</p>
<div class="org-src-container">

<pre class="src src-sh">cmake                                                     <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_INSTALL_PREFIX=${<span class="org-variable-name">SW_WORK_DIR</span>}/Cadfael/install <span class="org-sh-escaped-newline">\</span>
    -DCADFAEL_VERBOSE_BUILD=ON                            <span class="org-sh-escaped-newline">\</span>
    -DCADFAEL_STEP_TARGETS=ON                             <span class="org-sh-escaped-newline">\</span>
    -Dport/patchelf=ON                                    <span class="org-sh-escaped-newline">\</span>
    -Dport/gsl=ON                                         <span class="org-sh-escaped-newline">\</span>
    -Dport/clhep=ON                                       <span class="org-sh-escaped-newline">\</span>
    -Dport/boost=ON                                       <span class="org-sh-escaped-newline">\</span>
    -Dport/boost+<span class="org-variable-name">regex</span>=ON                                 <span class="org-sh-escaped-newline">\</span>
    -Dport/camp=ON                                        <span class="org-sh-escaped-newline">\</span>
    -Dport/xerces-c=ON                                    <span class="org-sh-escaped-newline">\</span>
    -Dport/geant4=ON                                      <span class="org-sh-escaped-newline">\</span>
    -Dport/geant4+<span class="org-variable-name">gdml</span>=ON                                 <span class="org-sh-escaped-newline">\</span>
    -Dport/geant4+<span class="org-variable-name">x11</span>=ON                                  <span class="org-sh-escaped-newline">\</span>
    -Dport/geant4+<span class="org-variable-name">data</span>=ON                                 <span class="org-sh-escaped-newline">\</span>
    -Dport/root=ON                                        <span class="org-sh-escaped-newline">\</span>
    -Dport/root+<span class="org-variable-name">x11</span>=ON                                    <span class="org-sh-escaped-newline">\</span>
    -Dport/root+<span class="org-variable-name">asimage</span>=ON                                <span class="org-sh-escaped-newline">\</span>
    -Dport/root+<span class="org-variable-name">mathmore</span>=ON                               <span class="org-sh-escaped-newline">\</span>
    -Dport/root+<span class="org-variable-name">opengl</span>=ON                                 <span class="org-sh-escaped-newline">\</span>
    ${<span class="org-variable-name">SW_WORK_DIR</span>}/Cadfael/trunk/
</pre>
</div>
<p>
then execute the <code>make</code> command
</p>
<div class="org-src-container">

<pre class="src src-sh">make
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">Ports status <code>[8/8]</code></h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li><code>[X]</code> patchelf
</li>
<li><code>[X]</code> GSL
</li>
<li><code>[X]</code> CLHEP
</li>
<li><code>[X]</code> boost
</li>
<li><code>[X]</code> camp
</li>
<li><code>[X]</code> xerces-c
</li>
<li><code>[X]</code> Geant4
<ul class="org-ul">
<li><code>[X]</code> <code>-Dport/geant4+gdml</code> will install Xerces-C
</li>
<li><code>[X]</code> <code>-Dport/geant4+data</code>
</li>
</ul>
</li>
<li><code>[X]</code> ROOT
<ul class="org-ul">
<li><code>[X]</code> <code>-Dport/root+mathmore</code>
</li>
<li><code>[X]</code> <code>-Dport/root+opengl</code>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Bayeux</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Checking out</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-sh">svn co https://nemo.lpc-caen.in2p3.fr/svn/Bayeux/trunk <span class="org-sh-escaped-newline">\</span>
    ${<span class="org-variable-name">SW_WORK_DIR</span>}/Bayeux/trunk
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Configuration</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
To setup <code>Bayeux</code>, first create the following directory
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir -p ${<span class="org-variable-name">SW_WORK_DIR</span>}/Bayeux/build &amp;&amp; <span class="org-builtin">cd</span> ${<span class="org-variable-name">SW_WORK_DIR</span>}/Bayeux/build
</pre>
</div>
<p>
Then simply do
</p>
<div class="org-src-container">

<pre class="src src-sh">cmake                                                    <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_INSTALL_PREFIX=${<span class="org-variable-name">SW_WORK_DIR</span>}/Bayeux/install <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_PREFIX_PATH=${<span class="org-variable-name">SW_WORK_DIR</span>}/Cadfael/install   <span class="org-sh-escaped-newline">\</span>
    -DBayeux_ENABLE_TESTING=ON                           <span class="org-sh-escaped-newline">\</span>
    -DBayeux_WITH_GEANT4=ON                              <span class="org-sh-escaped-newline">\</span>
    ${<span class="org-variable-name">SW_WORK_DIR</span>}/Bayeux/trunk/
</pre>
</div>

<p>
To run the compilation process on several CPU cores do
</p>
<div class="org-src-container">

<pre class="src src-sh">make -j6 install
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">Test programs <code>[10/10]</code></h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Adding option <code>-DBayeux_ENABLE_TESTING=ON</code> to the <code>cmake</code> command will enable
the compilation of test programs. Then doing <code>make test</code> will launch each of
the <b>238 test programs</b> and it will eventually shows some broken tests.
</p>

<ul class="org-ul">
<li><code>[X]</code> datatools
</li>
<li><code>[X]</code> brio
</li>
<li><code>[X]</code> cuts
</li>
<li><code>[X]</code> genbb_help
</li>
<li><code>[X]</code> geomtools
</li>
<li><code>[X]</code> genvtx
</li>
<li><code>[X]</code> mygsl
</li>
<li><code>[X]</code> materials
</li>
<li><code>[X]</code> dpp
</li>
<li><code>[X]</code> mctools
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Falaise</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">Checking out</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">

<pre class="src src-sh">svn co https://nemo.lpc-caen.in2p3.fr/svn/Falaise/trunk <span class="org-sh-escaped-newline">\</span>
    ${<span class="org-variable-name">SW_WORK_DIR</span>}/Falaise/trunk
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">Configuration</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
To setup <code>Falaise</code> with an already version of <code>Bayeux</code> installed, first create
the following directory
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir -p ${<span class="org-variable-name">SW_WORK_DIR</span>}/Falaise/build &amp;&amp; <span class="org-builtin">cd</span> ${<span class="org-variable-name">SW_WORK_DIR</span>}/Falaise/build
</pre>
</div>
<p>
Then configure <code>Falaise</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">cmake                                                                                  <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_INSTALL_PREFIX=${<span class="org-variable-name">SW_WORK_DIR</span>}/Falaise/install                              <span class="org-sh-escaped-newline">\</span>
    -DCMAKE_PREFIX_PATH=<span class="org-string">"${SW_WORK_DIR}/Cadfael/install;${SW_WORK_DIR}/Bayeux/install"</span> <span class="org-sh-escaped-newline">\</span>
    -DFalaise_ENABLE_TESTING=ON                                                        <span class="org-sh-escaped-newline">\</span>
    -DFalaise_BUILD_DOCS=OFF                                                           <span class="org-sh-escaped-newline">\</span>
    -DFalaise_USE_SYSTEM_BAYEUX=ON                                                     <span class="org-sh-escaped-newline">\</span>
    ${<span class="org-variable-name">SW_WORK_DIR</span>}/Falaise/trunk
</pre>
</div>

<p>
<b>Remark:</b> <code>doxygen</code> version @ Lyon is 1.6 which does not fulfill requirements
for building <code>Falaise</code> documentation.
</p>

<p>
To run the compilation process on several CPU cores do
</p>
<div class="org-src-container">

<pre class="src src-sh">make -j6 install
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">Basic tests</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">cd</span> ${<span class="org-variable-name">SW_WORK_DIR</span>}/Falaise/build
./BuildProducts/bin/flsimulate -n 10 -o /tmp/${<span class="org-variable-name">USER</span>}/snemo_tc_muons_roof.xml
./BuildProducts/bin/flreconstruct -i /tmp/${<span class="org-variable-name">USER</span>}/snemo_tc_muons_roof.xml
</pre>
</div>

<p>
Tests successfully passed.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
